{"name":"The Honorable Daniel J. Anders","assigned":[["PA - Philadelphia County Court of Common Pleas","+1 (215) 686-7917"]],"bio":"The Hon. Daniel J. Anders is a judge for the Philadelphia County Court of Common Pleas in Pennsylvania. Anders was appointed to the bench by former Governor Ed Rendell in 2007.\n\nOver the course of his judicial career, Anders has held assignments in the Family Court Division, the Criminal Trial Division, and the Civil Trial Division. He was also named Supervising Judge of the First Judicial District’s Civil Division.\n\nPrior to his appointment, Anders worked as an attorney at Pepper Hamilton, where he handled business litigation matters. During this time, he also performed pro bono work on behalf of the LGBT community, serving as general counsel to the Elton John AIDS Foundation and defending the City of Allentown’s anti-discrimination ordinance.\n\nAnders earned a B.A. in political science from Lehigh University in 1990. He then completed a J.D. at the University of Pittsburgh School of Law in 1998.\n\nHis memberships have included the International Association of LGBTQ+ Judges and the Supreme Court of Pennsylvania Civil Procedural Rules Committee. He teaches Pennsylvania Civil Practice at Drexel University Kline School of Law and sits as the general editor of Ohlbaum on the Pennsylvania Rules of Evidence.\n\nAnders is the first openly gay male judge to serve on the Philadelphia Court of Common Pleas. He is a recipient of the Michael Greenberg Award for Lifetime Achievement from GALLOP, and he was named Pro Bono Attorney of the Year by Equality Advocates.\n\nWhen not presiding over legal matters, Anders photography and running along the Schuylkill River.\n\nHe is registered as a Democrat.","career":[["Associate","Pepper Hamilton LLP","Philadelphia County, Pennsylvania"]],"education":[["Lehigh University  Degree: B.A.  Year:1990  Notes: Political Science","University of Pittsburgh School of Law  Degree: J.D.  Year:1998 "]],"press":[["The Philadelphia Inquirer: ","Inquirer Judicial Candidate Questionnaire","http://media.philly.com/documents/danandersPCP.pdf"],["The Legal Intelligencer: ","Anders Appointed Supervising Judge of FJD Civil Division","https://www.law.com/thelegalintelligencer/2020/11/02/anders-appointed-supervising-judge-of-fjd-civil-division/"],["Martindale: ","Judge Profile: Daniel James Anders","https://www.martindale.com/attorney/daniel-james-anders-1545990/"],["Ballotpedia: ","Daniel J. Anders","https://ballotpedia.org/Daniel_J._Anders"]]}