{"name":"The Honorable Giovanni O. Campbell","assigned":[["PA - Philadelphia County Court of Common Pleas","+1 (215) 683-7121"],["+1 (215) 683-7123"]],"bio":"The Hon. Giovanni O. Campbell is a judge for the Philadelphia County Court of Common Pleas in Pennsylvania. He was elected to the bench in 2013.\n\nCampbell earned a B.A. in interdisciplinary social sciences from Stony Brook University in 1989. He spent the next few years working as resource personnel in the Office of Zoning \u0026 Integration for the New York City Board of Education. Then, in 1993, he completed a J.D. at Temple University James E. Beasley School of Law.\n\nAfter graduating from law school, Campbell entered into private practice. He started as an associate at the Law Office of Renee Cardwell Hughes before opening his own private practice in 1995. He specialized in criminal defense and civil rights matters. During this time, he undertook pro bono projects through the Volunteers for the Indigent Program and the Public Interest Law Center.\n\nHis memberships have included the Federal Bar Association (Criminal Defense Committee), the Pennsylvania Association of Criminal Defense Lawyers, the Philadelphia Bar Association, the Council for Parent and Attorney Advocates, and the Greater Philadelphia Hispanic Chamber of Commerce.\n\nCampbell was born in Panama City. His mother served as a special education teacher, and his father worked as a laborer and manager of warehouses. He relocated to New York City when he was twelve years old.\n\nHe is registered as a Democrat.","career":[["Managing Attorney","Giovanni O. Campbell, Attorney at Law, P.C","Philadelphia County, Pennsylvania"],["Associate","Law Office of Renee Cardwell Hughes","Philadelphia County, Pennsylvania"]],"education":[["Stony Brook University  Degree: B.A.  Year:1989  Notes: Interdisciplinary Social Sciences","Temple University James E. Beasley School of Law  Degree: J.D.  Year:1993 "]],"press":[["The Philadelphia Inquirer: ","Inquirer Judicial Candidate Questionnaire","http://media.philly.com/documents/InquirerQuestionnaire.4.11.11.pdf"],["Ballotpedia: ","Giovanni O. Campbell","https://ballotpedia.org/Giovanni_O._Campbell"]]}