{"name":"The Honorable Howland W. Abramson",
  "assigned":[
    ["PA - Philadelphia County Court of Common Pleas"]
  ],
  "bio":"The Hon. Howland W. Abramson (Ret.) served as a judge for the Philadelphia County Court of Common Pleas in Pennsylvania. He retired from the bench in 2011 and joined Panafrican Satellite Communications, Inc. as its Vice President and Chief Compliance Officer.\n\nBefore joining the bench, Abramson served as a deputy attorney general for the Pennsylvania Office of the Attorney General, where he represented the judicial branch of Pennsylvania and all its instrumentalities.\n\nAbramson earned a B.A. from the University of Pennsylvania in 1970. He then completed an M.B.A. at the University of Pennsylvania, Wharton School of Business (1972) and a J.D. at Temple University, James E. Beasley School of Law (1975).\n\nHis memberships have included the Judicial Ethics Committee of the Pennsylvania Conference of State Trial Judges.",
  "career":[
    ["Deputy Attorney General", "Office of the Pennsylvania Attorney General", "None"],
    ["Judge", "Court of Common Pleas", "Philadelphia County, Pennsylvania"]
  ],
  "education":[
    ["University of Pennsylvania  Degree: B.A.  Year:1970 ", "University of Pennsylvania, Wharton School of Business  Degree: M.B.A.  Year:1972 "],
    ["Temple University, James E. Beasley School of Law  Degree: J.D.  Year:1975 "]
  ],
  "press":[
    ["Law: ", "Pa. Commerce Court Debuts New Arbitration Protocols", "https://webcache.googleusercontent.com/search?q=cache:mvTKA-ivTdkJ:https://www.law.com/almID/900005559152/+\u0026cd=19\u0026hl=en\u0026ct=clnk\u0026gl=us"],
    ["Pittsburgh Post-Gazette: ", "Howland Abramson, Former Philadelphia Judge, Joins Telecom Startup", "https://www.post-gazette.com/business/legal/2012/01/09/Howland-Abramson-former-Philadelphia-judge-joins-telecom-startup/stories/201201090184"],
    ["Martindale: ", "Judge Profile: Howland W. Abramson", "https://www.martindale.com/attorney/howland-w-abramson-1540577/"],
    ["Ballotpedia: ", "Howland W. Abramson", "https://ballotpedia.org/Howland_W._Abramson"]
  ]
}
