{"name":"The Honorable Ida K. Chen","assigned":[["PA - Philadelphia County Court of Common Pleas","+1 (215) 686-2545"],["+1 (215) 686-4225"]],"bio":"The Hon. Ida K. Chen is a judge for the Philadelphia County Court of Common Pleas in Pennsylvania. She was appointed to the bench by former Governor Robert Casey in 1987, becoming the first Asian-American woman to serve as a judge in the Commonwealth of Pennsylvania.\n\nPrior to her appointment, Chen served as a trial attorney for the United States Equal Employment Opportunity Commission (1976 to 1986) and the Philadelphia Human Relations Commission (1986 to 1987).\n\nChen earned a B.S. from Temple University in 1973. She then completed a J.D. at Temple University James E. Beasley School of Law in 1976.\n\nHer memberships have included the Ethics Committee of the 21st Century Review Forum for the City of Philadelphia as well as the Interbranch Commission for Gender, Racial \u0026 Ethnic Fairness. She sat on the board of the Samuel S. Fels Fund, the American Association of Ethnic Chinese, ActionAIDS, AIDS Services in Asian Communities, Blacks Education Blacks About Sexual Health Issues, the Free Library of Philadelphia, Philadelphia Volunteers for the Indigent Program, the Southeast Asian Mutual Assistance Associations Coalition, and the St. Christopher’s Hospital Foundation.\n\nShe is a recipient of the Distinguished Public Service Award from the American Association for Applied Linguistics.\n\nBorn in Hong Kong, Chen immigrated to the United States after living in Indonesia.","career":[["Trial Attorney","United States Equal Employment Opportunity Commission","None"],["Member","Philadelphia Human Relations Commission","Philadelphia County, Pennsylvania"]],"education":[["Temple University  Degree: B.S.  Year:1973 ","Temple University James E. Beasley School of Law  Degree: J.D.  Year:1976 "]],"press":[["Samuel S. Fels Fund: ","Ida K. Chen","http://www.samfels.org/board/ida-k-chen-vice-chair/"],["Ballotpedia: ","Ida K. Chen","https://ballotpedia.org/Ida_K._Chen"],["American Association for Applied Linguistics: ","Honorable Ida K. Chen and Osvaldo Aviles","https://www.aaal.org/honorable-ida-k-chen-and-osvaldo-aviles"],["Drexel University Thomas R. Kline School of Law: ","The Hon. Ida K. Chen","https://drexel.edu/law/about/leadership/board/BoardMembers/The%20Hon%20Ida%20K%20Chen/"],["Pennsylvania Interbranch Commission: ","Ida Chen","http://www.pa-interbranchcommission.com/members/ida-chen.html"]]}