{"name":"The Honorable Jacqueline F. Allen","assigned":[["PA - Philadelphia County Court of Common Pleas","+1 (215) 686-2602"],["+1 (215) 686-9509"]],"bio":"The Hon. Jacqueline F. Allen is a judge for the Philadelphia County Court of Common Pleas in Pennsylvania. Allen was elected to the bench in 1994.\n\nOver the course of her judicial career, Allen held assignments as the Administrative Judge of the Trial Division of the Philadelphia County Court of Common Pleas.\n\nAllen earned a B.A. from Lincoln University (1974) and a master’s degree from The Ohio State University. She then completed a J.D. at Temple University Beasley School of Law in 1979.\n\nAfter graduating from law school, Allen began her legal career as a law clerk with the Hon. Julian F. King of the Philadelphia County Court of Common Pleas. She then worked as a trial attorney in the litigation departments of Unisys, Conrail, and Southeastern Pennsylvania Transportation Authority. During her tenure there, she handled persona injury and product performance litigation matters.\n\nHer memberships have included the Philadelphia Bar Association’s Advancing Civics Education Committee and the Presbyterian Community Ministries of the Delaware Valley. She also sat as co-chair of the Pennsylvania Conference of State Trial Judges Education Committee and chair of the Scholarship Committee of the Foundation of the National Bar Association Women Lawyers Division.\n\nAllen is a recipient of the Sandra Day O’Connor Award from the Philadelphia Bar Association (2018).\n\nShe is registered as a Democrat.","career":[["Law Clerk","Court of Common Pleas","Philadelphia County, Pennsylvania"],["Attorney","Unisys Corporation","Montgomery County, Pennsylvania"],["Attorney","Consolidated Rail Corporation","Philadelphia County, Pennsylvania"],["Attorney","Southeastern Pennsylvania Transportation Authority","Philadelphia County, Pennsylvania"]],"education":[["Lincoln University  Degree: B.A.  Year:1974 ","The Ohio State University  Degree: Master's degree "],["Temple University Beasley School of Law  Degree: J.D.  Year:1979 "]],"press":[["The Philadelphia Inquirer: ","In a First, Two African American Women Named Top Leaders of Phila. Courts","https://www.inquirer.com/philly/news/politics/20160128_In_a_first__two_African_American_women_named_top_leaders_of_Phila__courts.html"],["Philadelphia Bar Reporter: ","Judge Jacqueline F. Allen to Receive O'Connor Award","https://www.philadelphiabar.org/WebObjects/PBAReadOnly.woa/Contents/WebServerResources/CMSResources/May2018.pdf"],["Ballotpedia: ","Jacqueline F. Allen","https://ballotpedia.org/Jacqueline_F._Allen"]]}