{"name":"The Honorable Lucretia C. Clemons","assigned":[["PA - Philadelphia County Court of Common Pleas","+1 (215) 683-7077"],["+1 (215) 683-7079"]],"bio":"The Hon. Lucretia C. Clemons is a judge for the Philadelphia County Court of Common Pleas in Pennsylvania. Clemons was appointed to the bench by Governor Tom Wolf on June 13, 2016. She was subsequently elected to the seat on November 7, 2017.\n\nClemons attended New York University, where she earned a B.S. in hotel and restaurant management (1993) and an M.A. in diversity management (1996). She then completed a J.D. at Temple University James E. Beasley School of Law in 1999.\n\nAfter graduating from law school, Clemons began her legal career as a law clerk for the Hon. Clifford Scott Green of the United States District Court for the Eastern District of Pennsylvania. Then, 2000, she entered into private practice. Clemons started as an associate at Pepper Hamilton. Two years later, she moved to Ballard Spahr, where she worked as a partner in the firm’s Labor \u0026 Employment Group and Minority Associates Group until her appointment to the bench.\n\nHer memberships have included the Philadelphia Bar Association, the Barristers Association of Philadelphia, and the Delta Sigma Theta Sorority.","career":[["Law Clerk","United States District Court for the Eastern District of Pennsylvania","Philadelphia County, Pennsylvania"],["Associate","Pepper Hamilton LLP","Philadelphia County, Pennsylvania"],["Partner","Ballard Spahr LLP","Philadelphia County, Pennsylvania"]],"education":[["New York University  Degree: B.S.  Year:1993  Notes: Hotel and Restaurant Management","New York University  Degree: M.A.  Year:1996  Notes: Diversity Management"],["Temple University James E. Beasley School of Law  Degree: J.D.  Year:1999 "]],"press":[["The Philadelphia Tribune: ","RoundUp: Council to Examine Issues Facing Low-Income Renters","https://www.phillytrib.com/news/roundup-council-to-examine-issues-facing-low-income-renters/article_cdefcddb-84ba-5e0a-9569-acfd7d1e1855.html"],["The Legal Intelligencer: At the Eye of the Storm?: Here's Who Will Be Running Philadelphia's 'Election Court'","At the Eye of the Storm?: Here's Who Will Be Running Philadelphia's 'Election Court'","https://www.law.com/thelegalintelligencer/2020/11/03/stepping-into-the-spotlight-heres-who-will-be-running-philadelphias-election-court/"],["Ballotpedia: ","Lucretia Clemons","https://ballotpedia.org/Lucretia_Clemons"],["Philly Judges: ","Lucretia Clemons","https://www.phillyjudges.com/component/jsn/lclemons"]]}