{"name":"The Honorable Mark I. Bernstein","assigned":[["PA - Philadelphia County Court of Common Pleas"]],"bio":"The Hon. Mark I. Bernstein (Ret.) served as a judge for the Philadelphia County Court of Common Pleas in Pennsylvania. Bernstein was appointed to the bench by former Governor Bob Casey in 1987. He retired in 2016 and opened his own mediation and arbitration practice.\n\nOver the course of his judicial career, Bernstein held assignments on the Civil Jury Instruction Committee and the Medical Malpractice Mediation Task Force for the Pennsylvania Supreme Court. He was also instrumental in designing and implementing the Day Forward Case Management System for the First Judicial District.\n\nBernstein earned a B.A. in liberal arts and sciences from St. John’s College in 1969. He then completed a J.D. at University of Pennsylvania Carey Law School in 1973.\n\nAfter graduating from law school, Bernstein began his legal career as an assistant public defender for the Defender Association of Philadelphia. He worked in that capacity until 1976, at which time he entered into private practice. Bernstein started as an associate at Martin Heller before becoming a partner at Fineman Krekstein \u0026 Harris in 1980.\n\nHis memberships have included the Philadelphia Bar Association, the Pennsylvania Bar Association, the Temple American Inn of Court, the American Conference of Business Court Judges, the American Bar Association (Judicial Division), and the Pennsylvania Conference of State Trial Judges.\n\nHe is a recipient of the Justice William J. Brennan, Jr. Distinguished Jurist Award from the Philadelphia Bar Association (2016).","career":[["Assistant Public Defender","Defender Association of Philadlephia","Philadelphia County, Pennsylvania"],["Associate","Martin Heller, P.C.","Philadelphia County, Pennsylvania"],["Partner","Fineman Krekstein \u0026 Harris, P.C.","Philadelphia County, Pennsylvania"],["Judge","Court of Common Pleas","Philadelphia County, Pennsylvania"]],"education":[["St. John's College  Degree: B.A.  Year:1969  Notes: Liberal Arts and Sciences","University of Pennsylvania Carey Law School  Degree: J.D.  Year:1973 "]],"press":[["Philadelphia Bar Association News: ","Judge Mark I. Bernstein to Receive the Justice Brennan Award at Bench-Bar","https://www.philadelphiabar.org/page/NewsItem?newsItemID=1001588"],["The Legal Intelligencer: ","Judge Profile","https://judges.pa.law.com/profile/Philadelphia_County_Court_of_Common_Pleas/Mark_Bernstein/Mark_Bernstein-543.xml"],["Ballotpedia: ","Mark I. Bernstein","https://ballotpedia.org/Mark_I._Bernstein"],["American Conference Institute: ","Hon. Mark I. Bernstein","https://www.americanconference.com/bad-faith-litigation-833i14-phi/speakers/hon-mark-i-bernstein/"]]}